public class Main {

    public static void main(String[] args) {
        System.out.println("Поехали!");
        
        // Кроме классов для описания задач, вам нужно реализовать класс для объекта-менеджера.
        // Он будет запускаться на старте программы и управлять всеми задачами.
        TaskManager tasks = new TaskManager();
        
        // Создайте две задачи, а также эпик с двумя подзадачами и  эпик с одной подзадачей.
        
        // Распечатайте списки эпиков, задач и подзадач через System.out.println(..).
        
        // Измените статусы созданных объектов, распечатайте их. Проверьте, что статус задачи и подзадачи сохранился, а статус эпика рассчитался по статусам подзадач.
        
        // И, наконец, попробуйте удалить одну из задач и один из эпиков.
        
        
        
        
        System.out.println("Приехали!");
    }
}
